Reports/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДействующие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ИсполнителиПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоЦеннымБумагам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СчетаДоверительногоУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Числовая часть кода счета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализированныйДепозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиКонсолидированныйБухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/КлиентыДоверительногоУправления/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ДобавитьГруппуКолонокВТаблицаКлиентов(ТаблицаКлиентов, ВидГруппы, НомерГруппы, ПрочиеПараметры = Неопределено)
	
	ИмяГруппы = Неопределено;
	
	Если       ВидГруппы = "Брокер" Тогда
		ИмяГруппы = "Брокер" + НомерГруппы;
		
		ТаблицаКлиентов.Колонки.Добавить(ИмяГруппы);
		ТаблицаКлиентов.Колонки.Добавить(ИмяГруппы + "_КодКлиента");
		ТаблицаКлиентов.Колонки.Добавить(ИмяГруппы + "_Договор");
		
	ИначеЕсли ВидГруппы = "СчетДепо" Тогда
		ИмяГруппы = "СчетДепо" + НомерГруппы;
		
		ТаблицаКлиентов.Колонки.Добавить(ИмяГруппы);
		ТаблицаКлиентов.Колонки.Добавить(ИмяГруппы + "_ТипВид"); // основной/торговый, если вид задан, 
		
	ИначеЕсли ВидГруппы = "РазделСчетаДепо" Тогда
		ИмяГруппы = "Раздел" + НомерГруппы + "ПоБрокеру" + ПрочиеПараметры.НомерБрокера + "СчетаДепо";
		
		ТаблицаКлиентов.Колонки.Добавить(ИмяГруппы, Новый ОписаниеТипов("СправочникСсылка.ДепозитарныеСчета"));
		
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции // ДобавитьКолонкиВТабличнуюЧасть 

&НаСервереБезКонтекста
Функция ПолучитьДействующихИсполнителей(Период, Организация, СчетДоверительногоУправления, МаксКоличествоСчетовДепо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Родитель КАК ДепозитарныйСчетРодитель,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета КАК ТипСчета,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ВидСчета КАК ВидСчета,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Брокер КАК Брокер
		|ИЗ
		|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|ГДЕ
		|	ИсполнителиПоЦеннымБумагам.Организация = &Организация
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаЗакрытия > &Период)
		|	И (ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	ДепозитарныйСчетРодитель";
		
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",                  Организация);
	
	Исполнители = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МаксКоличествоСчетовДепо = 0;
	
	МаксКоличествоРазделовПоБрокерам = Новый ТаблицаЗначений;
	МаксКоличествоРазделовПоБрокерам.Колонки.Добавить("Брокер",                 Новый ОписаниеТипов("СправочникСсылка.БрокерскиеКомпании"));
	МаксКоличествоРазделовПоБрокерам.Колонки.Добавить("МаксКоличествоРазделов", Новый ОписаниеТипов("Число"));
	МаксКоличествоРазделовПоБрокерам.Индексы.Добавить("Брокер");
	
	Для каждого СтрокаСчетДоверительногоУправления Из Исполнители.Строки Цикл
		// определим максимальное количество счетов д/у, сколько из них имеют разделы, к каким брокерам они относятся,
		// проверим уникальность депозитария
		КоличествоДепозитарныхСчетов = 0;
		Депозитарий                  = Неопределено;
		ДепозитарныйСчетСРазделами   = Неопределено;		
		
		Для Инд = -СтрокаСчетДоверительногоУправления.Строки.Количество() + 1 По 0 Цикл
			СтрокаДепозитарныйСчет = СтрокаСчетДоверительногоУправления.Строки[-Инд];
			
			Если Не ЗначениеЗаполнено(СтрокаДепозитарныйСчет.ДепозитарныйСчетРодитель) Тогда // это депозитарный счет без подчиненных разделов
				КоличествоДепозитарныхСчетов = КоличествоДепозитарныхСчетов + СтрокаДепозитарныйСчет.Строки.Количество();
				
				// вынесем счета д/у на уровень выше
				Для каждого СтрокаРазделДепозитарногоСчета Из СтрокаДепозитарныйСчет.Строки Цикл
					ЗаполнитьЗначенияСвойств(СтрокаСчетДоверительногоУправления.Строки.Добавить(), СтрокаРазделДепозитарногоСчета);
				КонецЦикла;
				
				// удалим ветку дерева с пустым родителем
				СтрокаСчетДоверительногоУправления.Строки.Удалить(СтрокаДепозитарныйСчет);
				
			Иначе // это депозитарные счет с подчиненными разделами
				Если ЗначениеЗаполнено(ДепозитарныйСчетСРазделами) Тогда
					Сообщить("У счета д/у " + СтрокаСчетДоверительногоУправления.СчетДоверительногоУправления + " присутствует более одного депозитарного счета с подч. разделами. Счет «" + СтрокаДепозитарныйСчет.ДепозитарныйСчетРодитель + "» не будет отображен.");
					СтрокаСчетДоверительногоУправления.Строки.Удалить(СтрокаДепозитарныйСчет);
				Иначе
					ДепозитарныйСчетСРазделами   = СтрокаДепозитарныйСчет.ДепозитарныйСчетРодитель;
					КоличествоДепозитарныхСчетов = КоличествоДепозитарныхСчетов + 1;
					
					СтрокаДепозитарныйСчет.ДепозитарныйСчет = СтрокаДепозитарныйСчет.Строки[0].ДепозитарныйСчетРодитель;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоДепозитарныхСчетов > МаксКоличествоСчетовДепо Тогда
			МаксКоличествоСчетовДепо = КоличествоДепозитарныхСчетов;
		КонецЕсли;
	КонецЦикла;	
	
	Исполнители.Колонки.Удалить("ДепозитарныйСчетРодитель");
	
	Возврат Исполнители;
	
КонецФункции // ПолучитьДействующихИсполнителей

&НаСервере
Процедура ЗаполнитьТабличныйДокументНаСервере(КлиентыДоверительногоУправления, МаксКоличествоБрокеров, МаксКоличествоСчетовДепо, МаксКоличествоРазделовПоБрокерам)
	
	ЭтаФорма.ТабличныйДокумент.Очистить();
	
	// получим макет для вывода в таблицу
	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	Макет          = ОтчетНаСервере.ПолучитьМакет("Макет");
	
	// шапка отчета
	Область = Макет.ПолучитьОбласть("ШапкаОтчета");
	Область.Параметры.Клиенты = ?(Отчет.ТолькоДействующие, "Действующие клиенты", "Клиенты");
	Область.Параметры.Период  = Формат(Отчет.Период, "ДФ=dd.MM.yyyy");
	
	Область.Параметры.ПериодФормирования = Формат(ТекущаяДата(), "");
	Область.Параметры.Пользователь       = РаботаСПользователями.ТекущийПользователь();
	Область.Параметры.ИнформационнаяБаза = СтрокаСоединенияИнформационнойБазы();
	
	ЭтаФорма.ТабличныйДокумент.Вывести(Область);
	
	
	// шапка таблицы
	ЭтаФорма.ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы|ПустаяКолонка"));
	
	ЭтаФорма.ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|СчетДУ"));
	ЭтаФорма.ТабличныйДокумент.НачатьГруппуКолонок("СчетДУ", Ложь);
	ЭтаФорма.ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|РеквизитыСчетаДУ"), 1, "СчетДУ");
	ЭтаФорма.ТабличныйДокумент.ЗакончитьГруппуКолонок();
	
	Для Инд = 0 По МаксКоличествоБрокеров - 1 Цикл
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|Брокер");
		Область.Параметры.СтатусБрокера = ?(Инд = 0, "Основной брокер", "Брокер");
		ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
		
		ЭтаФорма.ТабличныйДокумент.НачатьГруппуКолонок("Брокер" + Инд, Ложь);
		ЭтаФорма.ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|РеквизитыБрокера"), 1, "Брокер" + Инд);
		ЭтаФорма.ТабличныйДокумент.ЗакончитьГруппуКолонок();
	КонецЦикла;
	
	Для Инд = 0 По МаксКоличествоСчетовДепо - 1 Цикл
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|ДепозитарныйСчет");
		Область.Параметры.ВидДепозитарногоСчета = ?(Инд = МаксКоличествоСчетовДепо - 1, "Торговый", "Основной") + " счет депо"; // закладываемся, что разделы есть только у торгового счета, а что не торговый - то основной
		ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
	КонецЦикла;
	
	ЭтаФорма.ТабличныйДокумент.НачатьГруппуКолонок("РазделыСчетаДепо", Истина);
	Для НомБрокера = 0 По МаксКоличествоБрокеров - 1 Цикл
		КоличествоРазделовПоБрокеру = ?(МаксКоличествоРазделовПоБрокерам.Свойство("Брокер" + НомБрокера), МаксКоличествоРазделовПоБрокерам["Брокер" + НомБрокера], 0);
	
		Для НомРаздела = 0 По КоличествоРазделовПоБрокеру - 1 Цикл
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы|РазделДепозитарногоСчета");
			Область.Параметры.БрокерРаздела = ?(НомБрокера = 0, "Основной брокер", "Брокер");
			ЭтаФорма.ТабличныйДокумент.Присоединить(Область, 1, "РазделыСчетаДепо");
		КонецЦикла;
	КонецЦикла;	
	ЭтаФорма.ТабличныйДокумент.ЗакончитьГруппуКолонок();
	
	ЭтаФорма.ТабличныйДокумент.ФиксацияСверху = ЭтаФорма.ТабличныйДокумент.ВысотаТаблицы;
	
	
	// строки таблицы
	КлиентыДоверительногоУправления.Сортировать("СчетДУ_ВидДоговора, СчетДУ_КодСчета");
	
	ТекущийВидДоговораДУ = Неопределено;
	НомерГруппыСтрок     = 0;
	
	Для НомКлиента = 0 По КлиентыДоверительногоУправления.Количество() - 1 Цикл
		СтрокаКлиентыДоверительногоУправления = КлиентыДоверительногоУправления[НомКлиента];
		
		Если ТекущийВидДоговораДУ <> СтрокаКлиентыДоверительногоУправления.СчетДУ_ВидДоговора Тогда
			Если НомКлиента > 0 Тогда
				ЭтаФорма.ТабличныйДокумент.ЗакончитьГруппуСтрок();
			КонецЕсли;
			
			ТекущийВидДоговораДУ = СтрокаКлиентыДоверительногоУправления.СчетДУ_ВидДоговора;
			НомерГруппыСтрок     = НомерГруппыСтрок + 1;
			
			Область = Макет.ПолучитьОбласть("СтрокаВидДоговораДУ");
			Область.Параметры.СчетДУ_ВидДоговора = ТекущийВидДоговораДУ;
			Область.Область(1, 2, 1, ЭтаФорма.ТабличныйДокумент.ШиринаТаблицы).ЦветФона = Область.Область(1, 2).ЦветФона;
			ЭтаФорма.ТабличныйДокумент.Вывести(Область);
			
			ЭтаФорма.ТабличныйДокумент.НачатьГруппуСтрок();
		КонецЕсли;
		
		ЭтаФорма.ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаСчетДУ|ПустаяКолонка"), 1, "ГруппаСтрок" + НомерГруппыСтрок);
		
		// счет д/у
		Область = Макет.ПолучитьОбласть("СтрокаСчетДУ|СчетДУ");
		Область.Параметры.Заполнить(СтрокаКлиентыДоверительногоУправления);
		ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
		
		Область = Макет.ПолучитьОбласть("СтрокаСчетДУ|РеквизитыСчетаДУ");
		Область.Параметры.Заполнить(СтрокаКлиентыДоверительногоУправления);
		ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
		
		// брокеры
		Для Инд = 0 По МаксКоличествоБрокеров - 1 Цикл
			ИмяГруппыПолей = "Брокер" + Инд;
			
			Область = Макет.ПолучитьОбласть("СтрокаСчетДУ|Брокер");
			Область.Параметры.Брокер = СтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей];
			ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
			
			Область = Макет.ПолучитьОбласть("СтрокаСчетДУ|РеквизитыБрокера");
			Область.Параметры.Брокер_КодКлиента = СтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей + "_КодКлиента"];
			Область.Параметры.Брокер_Договор    = СтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей + "_Договор"];
			ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
		КонецЦикла;
		
		// счета депо
		Для Инд = 0 По МаксКоличествоСчетовДепо - 1 Цикл
			Область = Макет.ПолучитьОбласть("СтрокаСчетДУ|ДепозитарныйСчет");
			Область.Параметры.ДепозитарныйСчет = СтрокаКлиентыДоверительногоУправления["СчетДепо" + Инд];
			ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
		КонецЦикла;
		
		// разделы счета депо
		Для НомБрокера = 0 По МаксКоличествоБрокеров - 1 Цикл
			КоличествоРазделовПоБрокеру = ?(МаксКоличествоРазделовПоБрокерам.Свойство("Брокер" + НомБрокера), МаксКоличествоРазделовПоБрокерам["Брокер" + НомБрокера], 0);
		
			Для НомРаздела = 0 По КоличествоРазделовПоБрокеру - 1 Цикл
				РазделДепозитарногоСчета = СтрокаКлиентыДоверительногоУправления["Раздел" + НомРаздела + "ПоБрокеру" + НомБрокера + "СчетаДепо"];
				
				Область = Макет.ПолучитьОбласть("СтрокаСчетДУ|РазделДепозитарногоСчета");
				Область.Параметры.РазделДепозитарногоСчета               = РазделДепозитарногоСчета;
				Область.Параметры.ПредставлениеРазделаДепозитарногоСчета = РазделДепозитарногоСчета.НомерСчета + Символы.ПС + Строка(РазделДепозитарногоСчета);
				ЭтаФорма.ТабличныйДокумент.Присоединить(Область);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Если НомерГруппыСтрок > 0 Тогда
		ЭтаФорма.ТабличныйДокумент.ЗакончитьГруппуСтрок();
	КонецЕсли;

	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ЭтаФорма.ТабличныйДокумент, РеквизитФормыВЗначение("Отчет").Метаданные().ПолноеИмя());
КонецПроцедуры // ЗаполнитьТабличныйДокументНаСервере

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Механизм = "Отчет.КлиентыДоверительногоУправления.Форма.СформироватьОтчетНаСервере()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(РеквизитФормыВЗначение("Отчет"));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	КлиентыДоверительногоУправления = Новый ТаблицаЗначений;
	
	// группа счет д/у
	КлиентыДоверительногоУправления.Колонки.Добавить("СчетДУ");
	КлиентыДоверительногоУправления.Колонки.Добавить("СчетДУ_Родитель");
	КлиентыДоверительногоУправления.Колонки.Добавить("СчетДУ_КодСчета");
	КлиентыДоверительногоУправления.Колонки.Добавить("СчетДУ_ВидДоговора");
	КлиентыДоверительногоУправления.Колонки.Добавить("СчетДУ_Договор");
	
	МаксКоличествоБрокеров   = 0;
	МаксКоличествоСчетовДепо = 0;

	ДеревоИсполнителей = ПолучитьДействующихИсполнителей(Отчет.Период, Отчет.Организация, Отчет.СчетДоверительногоУправления, МаксКоличествоСчетовДепо);
	
	РазделыДепозитарныхСчетов = Новый ТаблицаЗначений;
	РазделыДепозитарныхСчетов.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	РазделыДепозитарныхСчетов.Колонки.Добавить("Брокер",                       Новый ОписаниеТипов("СправочникСсылка.БрокерскиеКомпании"));
	РазделыДепозитарныхСчетов.Колонки.Добавить("РазделДепозитарногоСчета",     Новый ОписаниеТипов("СправочникСсылка.ДепозитарныеСчета"));
	РазделыДепозитарныхСчетов.Индексы.Добавить("СчетДоверительногоУправления");
	
	//ИсполнителиНаСервере = РеквизитФормыВЗначение("Исполнители"); // нужно, чтобы легко и просто увидеть исполнителей
	//РаботаСКоллекциями.ДеревоЗначений_ЗаполнитьИзДерева(ИсполнителиНаСервере, ДеревоИсполнителей, Истина);
	//ЗначениеВРеквизитФормы(ИсполнителиНаСервере, "Исполнители");
	
	Для Инд = 0 По МаксКоличествоСчетовДепо - 1 Цикл
		ДобавитьГруппуКолонокВТаблицаКлиентов(КлиентыДоверительногоУправления, "СчетДепо", Инд);
	КонецЦикла;
	
	МаксКоличествоРазделовПоБрокерам = Новый Структура();
	
	// счета доверительного управления
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Родитель КАК РодительСчетаДоверительногоУправления,
		|	СчетаДоверительногоУправления.ВидСчетаДоверительногоУправления КАК ВидСчетаДоверительногоУправления,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодКлиентаУБрокера,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания,
		|	ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер, ЛОЖЬ) КАК ОсновнойБрокер
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&Период, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &Период
		|			ИЛИ &ОтображатьВсеСчетаДоверительногоУправления)
		|	И (СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|ИТОГИ
		|	КОЛИЧЕСТВО(Брокер)
		|ПО
		|	СчетДоверительногоУправления";

	Запрос.УстановитьПараметр("Период",                                     Отчет.Период);
	Запрос.УстановитьПараметр("Организация",                                Отчет.Организация);
	Запрос.УстановитьПараметр("ОтображатьВсеСчетаДоверительногоУправления", Не Отчет.ТолькоДействующие);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",               Отчет.СчетДоверительногоУправления);	

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаСчетДоверительногоУправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчетДоверительногоУправления.Следующий() Цикл
		// заполним реквизиты счета д/у
		НоваяСтрокаКлиентыДоверительногоУправления = КлиентыДоверительногоУправления.Добавить();
		НоваяСтрокаКлиентыДоверительногоУправления.СчетДУ             = ВыборкаСчетДоверительногоУправления.СчетДоверительногоУправления;
		НоваяСтрокаКлиентыДоверительногоУправления.СчетДУ_Родитель    = ВыборкаСчетДоверительногоУправления.РодительСчетаДоверительногоУправления;
		НоваяСтрокаКлиентыДоверительногоУправления.СчетДУ_КодСчета    = ВыборкаСчетДоверительногоУправления.КодСчета;
		НоваяСтрокаКлиентыДоверительногоУправления.СчетДУ_Договор     = "№ " + ВыборкаСчетДоверительногоУправления.НомерДоговора + " от " + Формат(ВыборкаСчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
		НоваяСтрокаКлиентыДоверительногоУправления.СчетДУ_ВидДоговора = ВыборкаСчетДоверительногоУправления.ВидДоговораДоверительногоУправления;
			
		// при необходимости, добавим колонки брокеров в таблицу значений
		КоличествоБрокеров = ?(ВыборкаСчетДоверительногоУправления.Брокер = NULL, 0, ВыборкаСчетДоверительногоУправления.Брокер);
		
		Если КоличествоБрокеров > 0 Тогда
			Если КоличествоБрокеров > МаксКоличествоБрокеров Тогда
				Для Инд = МаксКоличествоБрокеров + 1 По КоличествоБрокеров Цикл
					ДобавитьГруппуКолонокВТаблицаКлиентов(КлиентыДоверительногоУправления, "Брокер", Инд - 1);
					МаксКоличествоРазделовПоБрокерам.Вставить("Брокер" + (Инд - 1), 0);
				КонецЦикла;
				МаксКоличествоБрокеров = ВыборкаСчетДоверительногоУправления.Брокер;
			КонецЕсли;
			
			// 1-м проходом по детальным записям заполним реквизиты счета д/у и определим основного брокера
			ОсновнойБрокерВыбран = Ложь;
			
			ВыборкаДетальныеЗаписи = ВыборкаСчетДоверительногоУправления.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.ОсновнойБрокер Тогда
					// заполним основного брокера
					НоваяСтрокаКлиентыДоверительногоУправления["Брокер0"]            = ВыборкаДетальныеЗаписи.Брокер;
					НоваяСтрокаКлиентыДоверительногоУправления["Брокер0_КодКлиента"] = ВыборкаДетальныеЗаписи.КодКлиентаУБрокера;
					НоваяСтрокаКлиентыДоверительногоУправления["Брокер0_Договор"]    = ВыборкаДетальныеЗаписи.ДоговорБрокерскогоОбслуживания;
					
					ОсновнойБрокерВыбран = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ОсновнойБрокерВыбран Тогда
				Сообщить("Не задан основной брокер по счету д/у " + ВыборкаСчетДоверительногоУправления.СчетДоверительногоУправления + ". Будет использован 1-й выбранный.");
				НомерГруппыПолей = 0;
			Иначе
				НомерГруппыПолей = 1;
			КонецЕсли;
			
			// 2-м проходом заполним брокеров
			ВыборкаДетальныеЗаписи.Сбросить();
			
			БрокерыСчетаДоверительногоУправления = Новый Массив(); // потребуются, чтобы проверить соответствие брокеров в разделах счетов д/у
			
			ВыборкаДетальныеЗаписи = ВыборкаСчетДоверительногоУправления.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				БрокерыСчетаДоверительногоУправления.Добавить(ВыборкаДетальныеЗаписи.Брокер);
				
				Если Не ВыборкаДетальныеЗаписи.ОсновнойБрокер Тогда
					ИмяГруппыПолей = "Брокер" + НомерГруппыПолей;
					
					НоваяСтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей]                 = ВыборкаДетальныеЗаписи.Брокер;
					НоваяСтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей + "_КодКлиента"] = ВыборкаДетальныеЗаписи.КодКлиентаУБрокера;
					НоваяСтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей + "_Договор"]    = ВыборкаДетальныеЗаписи.ДоговорБрокерскогоОбслуживания;
					
					НомерГруппыПолей = НомерГруппыПолей + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// заполним счета депо
		ДепозитарныеСчета = ДеревоИсполнителей.Строки.Найти(ВыборкаСчетДоверительногоУправления.СчетДоверительногоУправления, "СчетДоверительногоУправления");
		Если ДепозитарныеСчета <> Неопределено Тогда
			НомГруппыПолей = 0;
			
			Для каждого СтрокаДепозитарныйСчет Из ДепозитарныеСчета.Строки Цикл
				Если СтрокаДепозитарныйСчет.Строки.Количество() > 0 Тогда // это счет с разделами, он идет в самый конец
					ИмяГруппыПолей = "СчетДепо" + (МаксКоличествоСчетовДепо - 1);
					
					// проверим, все ли брокера из разделов попадут в итоговую таблицу
					Для каждого СтрокаРазделыДепозитарногоСчета Из СтрокаДепозитарныйСчет.Строки Цикл
						Если БрокерыСчетаДоверительногоУправления.Найти(СтрокаРазделыДепозитарногоСчета.Брокер) = Неопределено Тогда
							Сообщить("Пропущен раздел «" + СтрокаРазделыДепозитарногоСчета.ДепозитарныйСчет + "» депозитарного счета " + СтрокаДепозитарныйСчет.ДепозитарныйСчет + "», т.к. не зафиксирована связь счета д/у «" + ВыборкаСчетДоверительногоУправления.СчетДоверительногоУправления + "» с брокером «" + СтрокаРазделыДепозитарногоСчета.Брокер + "».");
						Иначе
							НоваяСтрокаРазделыДепозитарныхСчетов = РазделыДепозитарныхСчетов.Добавить();
							НоваяСтрокаРазделыДепозитарныхСчетов.СчетДоверительногоУправления = СтрокаРазделыДепозитарногоСчета.СчетДоверительногоУправления;
							НоваяСтрокаРазделыДепозитарныхСчетов.Брокер                       = СтрокаРазделыДепозитарногоСчета.Брокер;
							НоваяСтрокаРазделыДепозитарныхСчетов.РазделДепозитарногоСчета     = СтрокаРазделыДепозитарногоСчета.ДепозитарныйСчет;
						КонецЕсли;
					КонецЦикла;
					
					// определим макс. количество разделов по каждому брокеру
					Для каждого КлючЗначение Из МаксКоличествоРазделовПоБрокерам Цикл
						Брокер             = НоваяСтрокаКлиентыДоверительногоУправления[КлючЗначение.Ключ];
						КоличествоРазделов = СтрокаДепозитарныйСчет.Строки.НайтиСтроки(Новый Структура("Брокер", Брокер)).Количество();
						
						Если КоличествоРазделов > КлючЗначение.Значение Тогда
							МаксКоличествоРазделовПоБрокерам[КлючЗначение.Ключ] = КоличествоРазделов;
						КонецЕсли;						
					КонецЦикла;
					
				Иначе
					ИмяГруппыПолей = "СчетДепо" + НомГруппыПолей;
					НомГруппыПолей = НомГруппыПолей + 1;
				КонецЕсли;
				
				НоваяСтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей]             = СтрокаДепозитарныйСчет.ДепозитарныйСчет;
				НоваяСтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей + "_ТипВид"] = ?(ЗначениеЗаполнено(СтрокаДепозитарныйСчет.ВидСчета), СтрокаДепозитарныйСчет.ВидСчета, СтрокаДепозитарныйСчет.ТипСчета);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	// добавим колонки по разделам депозитарного счетам, заодно определим общее количество разделов
	Для НомБрокера = 0 По МаксКоличествоБрокеров - 1 Цикл
		КоличествоРазделовПоБрокеру = ?(МаксКоличествоРазделовПоБрокерам.Свойство("Брокер" + НомБрокера), МаксКоличествоРазделовПоБрокерам["Брокер" + НомБрокера], 0);
		
		Для НомРаздела = 0 По КоличествоРазделовПоБрокеру - 1 Цикл
			ДобавитьГруппуКолонокВТаблицаКлиентов(КлиентыДоверительногоУправления, "РазделСчетаДепо", НомРаздела, Новый Структура("НомерБрокера", НомБрокера));
		КонецЦикла;
	КонецЦикла;
	
	// заполним разделы депозитарного счета
	Для каждого СтрокаКлиентыДоверительногоУправления Из КлиентыДоверительногоУправления Цикл
		Для НомБрокера = 0 По МаксКоличествоБрокеров - 1 Цикл
			УсловиеОтбора = Новый Структура("СчетДоверительногоУправления, Брокер",
				СтрокаКлиентыДоверительногоУправления.СчетДУ,
				СтрокаКлиентыДоверительногоУправления["Брокер" + НомБрокера]);
			
			СтрокиРазделыРазделыДепозитарныхСчетов = РазделыДепозитарныхСчетов.НайтиСтроки(УсловиеОтбора);
				
			Для НомРаздела = 0 По СтрокиРазделыРазделыДепозитарныхСчетов.ВГраница() Цикл
				ИмяГруппыПолей = "Раздел" + НомРаздела + "ПоБрокеру" + НомБрокера + "СчетаДепо";
				СтрокаКлиентыДоверительногоУправления[ИмяГруппыПолей] = СтрокиРазделыРазделыДепозитарныхСчетов[НомРаздела].РазделДепозитарногоСчета;
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;	
	
	ЗаполнитьТабличныйДокументНаСервере(КлиентыДоверительногоУправления, МаксКоличествоБрокеров, МаксКоличествоСчетовДепо, МаксКоличествоРазделовПоБрокерам);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры // СформироватьОтчетНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период = ТекущаяДата();
	КонецЕсли;
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.ОтборПоСчетуДоверительногоУправления = ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборПоСчетуДоверительногоУправленияПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСчетуДоверительногоУправленияПриИзменении(Элемент)
	
	Элементы.СчетДоверительногоУправления.Видимость = ЭтаФорма.ОтборПоСчетуДоверительногоУправления;
	Элементы.ТолькоДействующие.Видимость            = Не ЭтаФорма.ОтборПоСчетуДоверительногоУправления;
	
	Если Не ЭтаФорма.ОтборПоСчетуДоверительногоУправления Тогда
		Отчет.СчетДоверительногоУправления = Неопределено;
	Иначе
		Отчет.ТолькоДействующие = Ложь;
	КонецЕсли;
	
КонецПроцедуры
